models/Category.php

    public function getList(){
        $arrList = [];
        foreach (Category::find()->all() as $key => $val){
---
SELECT * FROM `category`

    public function getAllCategory(){
        return Category::find()->all();
---
SELECT * FROM `category`