models/SignupForm.php

SELECT EXISTS(SELECT * FROM `user` WHERE (`user`.`email`='ag.stomick@gmail.com'))
INSERT INTO `user` (`username`, `surename`, `birthday`, `gender`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('Андрей', 'Гребенюк', '1984-01-06', 1, 'ag.stomick@gmail.com', '$2y$13$T9Euh4vgPkAvM1Dx1lmehe3KZE1vy3gJeBDKxWhlbVsfFfRkK9pSe', 'tSawlnyHX13NIPjp1pi6LogMe4fOd7qf', 10, 1517501134, 1517501134)
---
	public function signup() {

		$user           = new User();

		if ( null != $user->findOne(['email' => $this->email]) || !$this->validate() ) {
			return null;
		}


		$user->username = $this->username;
		$user->surename = $this->surename;
		$user->birthday = $this->birthday;
		$user->gender   = $this->gender;
		$user->email    = $this->email;
		$user->setPassword( $this->password );
		$user->generateAuthKey();

		return $user->save() ? $user : null;