models/User.php

SELECT * FROM `user` WHERE (`user_id`=15) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['user_id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `user` WHERE (`email`='ag.stomick@gmail.com') AND (`status`=10)
---
    public static function findByUseremail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `user` WHERE `email`='ag.stomick@gmail.com'
---
    public static function findUserNameByEmail($email){

        return static::findOne(['email' => $email])['username'];